{
  "date": "2020-03-20T12:27:34.139Z",
  "thumbnail": "/img/agua.jpg",
  "title": "Now you know, and knowing is half the battle",
  "description": " feel like I know a lot of what I need to learn about, and that is a bright path ahead.",
  "body": "Yes, that’s a quote from Gi Joe and it’s been quite a mantra on my learning journey.\n\nNo, I’m not a fan of the*real american hero*, but I often listen to this podcast[The Productivity Show.](http://www.asianefficiency.com/podcast/)They quoted it on one of the episodes and I found it a perfect concept for my learning experience.\n\nI’m far from knowing everything about user experience or user interface (if that’s even possible). But now I feel like I know a lot of what I need to learn about, and that is a bright path ahead.\n\nI’ll list below 4 things I’m seeking to learn more about:\n\n* **Coding**💻\n\nI’m definitely not a front end developer, but I understood the importance of knowing coding structures. It helped me to think my designs in a more consistent way.\n\nTo practice coding I exercise in[CodeAcademy](https://www.codecademy.com/)\n\n* **Design Patterns**🎨\n\nYeah, we all want to innovate and make a great work of art out of our interfaces, but come on, there are real people that will need to interact with whatever we’re designing. These people are already using digital products, and we’d help a lot knowing what kind of interactions they’re already used to. What do they expect from the shapes and colors we decide to use. To learn about web patterns I check frameworks documentations as[Bootstrap](https://getbootstrap.com/docs/4.1/getting-started/introduction/),[Vuetify](https://vuetifyjs.com/en/getting-started/quick-start)and read about components in[Google Material](https://material.io/design/components/).\n\n* **Information Architecture**🤓\n\nIn the years I worked as an art director for a advertising agency in Brazil, I had to make dozens of presentations. Many times I didn’t have any clear briefing, just a huge mess in a doc, or spread between emails and whatsapp messages. I didn’t know that all that work that I had to do gathering and organizing things before going into InDesign, was called Information Architecture. Now I’m just reading this book*[How to Make Sense of Any Mess](http://www.howtomakesenseofanymess.com/)**,***and I’m loving it!\n\n* **Cognitive Bias**🧠\n\nWeeks ago,[André Flórido](https://uptec.up.pt/ooo_andreflorido/?fbclid=IwAR3K0uFAbnc8UzBDAXNUtw1c4IRN_vnBo8zzWzCctVbpC30nlSlt8PsgvqQ), the co-founder of[Betmarkets](http://early.betmarkets.io/), the startup I’m collaborating with, told me about this thing called*[Survivorship Bias](https://brilliant.org/wiki/survivorship-bias/).*I was amazed by that concept, started thinking about the decisions in my life that might have been affected by that bias and everything… At that time (long long time less the 20 days ago), I didn’t have a clue about all the universe of*Cognitive Biases.*\n\nIt just became clearer for me of what a big thing this is, when a friend from the university called me to go to this event*[LadiesWineDesign](https://ladieswinedesign.com/porto/)(what deserves a full blog post about).*There, Joana Cerejo, a UX Consultant and Product Designer from Porto, gave us a talk about about**cognitive biases**and how they can affect the design process. The talk took place in a magical space here in Porto:*[Oupas! Design’](https://oupasdesign.com/)s*atelier.\n\nYou can read a small 61 items list of biases[here](https://www.ancrath.com/uploads/2/4/6/0/24609118/cognitive_bias_stack_-_2018_-_all.pdf).\n\nI hope this post helps other fellows following the same learning path and I thank you for your kind attention. ❤"
}