{
  "date": "2020-04-07T21:05:37.122Z",
  "title": "EDUCATIONAL PLATFORM",
  "body": "In the following job, I (together with Daniela Pereira) redesigned a tool to help teachers to diagnose reading issues and to keep track of kids development. At first, the challenge was to improve the UI, but after doing an audit on the platform and interviewing users and stakeholders we realized the opportunities the product had to make a real impact on teachers and students lives by adding machine learning solutions with an user-centered interface.\n\n\n\nProject partner:[Daniela Pinto Pereira, UX/UI designer](https://www.linkedin.com/in/danielap15/)\n\n\n\nThe process included:\n\n1. Audit\n\n2. User Research\n\n3. Creation of Personas and Scenarios\n\n4. Understanding Opportunities\n\n5. Design Requirements to Product Solution\n\n6. Flowchart redesign\n\n7. Sketches, Lo-fi and Mid-fi Prototyping\n\n8. User testing\n\n9. Hi-fi Prototyping\n\n10. Improvements based on user testing insights\n\n1. AUDIT\n\n![](https://pro2-bar-s3-cdn-cf6.myportfolio.com/c9705683af375f880d0107ef723fd86a/08680072-d735-480a-bb1e-6c77a1f78bf3_rw_1200.png?h=6a11a707f3fcfe814c404fb315788daa)\n\nThis was the initial platform. This version had navigation and consistency major problems. There were missing features such as \"delete groups\" and \"edit students\", and no feedback for actions such as \"edit group\".\n\nIt was made an audit analyzing more than 150 possible issues. On the Home screen we found problems such as:\n\n\\- Lack of a Home button on the menu, forcing the user to find the way by the logotype.\n\n\\- Blue text without link under a black text with a link, making the user think the blue one was clickable.\n\n\\- Page tittle with the teacher's name, looking like this was the account page, not a dashboard.\n\n\\- Non clickable text looking like buttons.\n\n\\- Information misplaced: teacher's account info was displayed on the dashboard as it was important for the teacher to keep an eye on his or her own info.\n\nThe analyzed areas were: Dashboard/Home, Navigation & IA, Page Layout & Visual Design, Form & Data Entry, Task Orientation and Help, Feedback, Error Tolerance.Click here to[see the whole audit.](https://docs.google.com/spreadsheets/d/1q874a9zn4PBpp5P0eeqUJP9wYC3FSLsJs_cYV03B9BI/edit?usp=sharing)\n\n2. USER RESEARCH\n\n![](https://pro2-bar-s3-cdn-cf.myportfolio.com/c9705683af375f880d0107ef723fd86a/b668aca5-a0d1-4968-af14-e99af16e54b3_rw_1200.png?h=86196bae48b00620dc7a0ac6bea9d065)\n\n![](https://pro2-bar-s3-cdn-cf1.myportfolio.com/c9705683af375f880d0107ef723fd86a/94d125b5-5d28-4726-8f37-d5dc4b11466c_rw_1200.png?h=8c1e456a2a350117b9867c2e392ccca1)\n\nRESEARCHERS INTERVIEWS\n\n\n\nWe first went to talk with the researchers specialized in reading learning issues who created the tool and all the content. We proceeded semi-structured interviews and navigated the platform with them. As stakeholders and creators, they were really too close to the project and couldn't point the usability issues we were looking for.\n\nThe conversations though were of crucial importance to understand the core feature and the potential impact that the platform could have if well implemented.\n\nTEACHERS INTERVIEWS\n\n\n\nThen, we visited a few schools and talked to teachers who were implementing the tool to intervene with their students. There we saw a completely different relation with the platform.\n\nThe teachers were not working with the concept of Diagnosis X Intervention. Instead they were using the platform as a mere repository of contents. Which was useful, but it was far from achieving the potential of the tool core feature of implementing digitally the researchers methods to diagnose and treat reading issues.\n\nWe asked the teachers, how the platform could improve their workday and then presented the professors method. They said this method would help a lot, specially if they had direct connection between the problems and solutions.\n\nUSER RESEARCH INSIGHTS\n\n\\- Impossibility of deleting students groups\n\n\\- Need of usage instruction\n\n\\- Desire to switch easily between different tasks\n\n\\- Need of high performance for low internet environments\n\n\\- Digital interaction motivate students, specially those with more problems\n\n\\- Unclear relation between teachers and students profile\n\n\\- Unclear connection between diagnosis and intervention module\n\n\\- \"There is too many things!\" - One of the teachers said that, what we understood it's a perception of the lack of visual hierarchy.\n\n3. CREATION OF PERSONAS AND SCENARIOS\n\n![](https://pro2-bar-s3-cdn-cf1.myportfolio.com/c9705683af375f880d0107ef723fd86a/92289a39-6f3f-4485-8857-5e5fa33fc3d6_rw_600.png?h=c8aa0a9cbe42f5cfc9f891a29650d15b)\n\n###### P1 - Cristina Pinho\n\n![](https://pro2-bar-s3-cdn-cf6.myportfolio.com/c9705683af375f880d0107ef723fd86a/a60b162e-cbdc-47cf-bcd1-b6321e13d17e_rw_600.png?h=58d83d7b34f901247d11fe6201dc7b44)\n\n###### P2 - Sara Lima\n\n![](https://pro2-bar-s3-cdn-cf3.myportfolio.com/c9705683af375f880d0107ef723fd86a/43971b19-4e1f-44ff-bca4-0f6f20304790_rw_600.png?h=fc3e9dcde1655221b816021fb1ac1503)\n\n###### P3 - João Ribeiro\n\n![](https://pro2-bar-s3-cdn-cf1.myportfolio.com/c9705683af375f880d0107ef723fd86a/29e9e531-02fc-4bf2-b6b8-e7e2d33c8aaf_rw_600.png?h=90ae684aaa41c486f23b41d1c2746944)\n\n###### P4 - Pedro Fonseca\n\nPersona 1 - TEACHER\n\nFictional Name:Cristina Pinho\n\nJob Title:Basic School Teacher\n\nDemographics:58 years old, married with 2 kids, Bachelor in Basic Education and Master in Special Education.\n\nGoals & Tasks: Dedicates her life to basic education and is always looking for new educational tools to create interest in her students.\n\nEnvironment:Cristina is an average user of technologies and has a computer available in the classroom as a work tool. From home surfs on the web from a tablet.\n\nQuote: \"I love to teach!\"\n\n\n\nPersona 2 - TEACHER\n\nFictional Name:Sara Lima\n\nJob Title: Educational Support Teacher\n\nDemographics: 40 years old, bachelor in Bachelor in Basic Education.\n\nGoals & Tasks: Sara's biggest goal is to improve educational standards. Help special students to overcome their difficulties is her life motivation.\n\nEnvironment:Spends most time of her day in the school. Between group classes and individual sessions. Understands that the students love technologies and uses that to call their attention to the classes content.\n\nQuote:“I believe in the transformational power of education!”\n\n\n\nPersona 3 - STUDENT\n\nFictional Name:João Ribeiro\n\nJob Title:Student\n\nDemographics:7 years old, is in the second grade of Basic School but due to his learning issues, has 1st grade reading skills.\n\nGoals & Tasks:His goal is to catch up with his class colleagues.\n\nEnvironment:Enjoys new technologies and gets really motivated by tablets and computers interactions.\n\nQuote:“Can I get the tablet?”\n\n\n\nPersona 4 - TEACHER\n\nFictional Name: Pedro Fonseca\n\nJob Title:Study Center Teacher\n\nDemographics:31 years old, bachelor in Basic Education and Master in Pre-School Education.\n\nGoals & Tasks: Help students to catch up with their homework an after class support.\n\nEnvironment:Pedro is a digital hard user. He's always online on his phone or on the desktop. As a teacher he likes to use digital platforms to motivate his students. He's a real pusher!\n\nQuote:“Let's try one more time?”\n\n\n\n###### SCENARIO 1\n\nNuma aula de Língua Portuguesa na turma da 1ª classe e Cristina apercebeu-se que alguns dos seus alunos ainda têm dificuldade em identificar letras. A escola onde leciona, começou a utilizar recentemente a plataforma Ainda Estou a Aprender, por isso decide utilizá-la como forma de motivar os seus alunos. No computador da sala de aula, ligado a um projetor, a Professora Cristina acede à plataforma e entra na área “O Que Já Sei” e escolhe o modo “Identificação de Letras”. Clica na 1ª tarefa e inicia a mesma, questionando os seus alunos alternadamente.\n\nSCENARIO 2 - P2 E 3\n\nÉ hora de aula de apoio de João, um dos alunos com maiores dificuldades de aprendizagem em Português, de Sara. Apesar das dificuldades, este aluno nutre particular interesse por computadores, por isso Sara utiliza frequentemente a Plataforma Ainda Estou a Aprender como método de ensino. Como o João já completou grande parte do modo de diagnóstico “O Que Já Sei”, a professora decide desafiá-lo a iniciar algumas tarefas no modo “O Que Vou Aprender”. Sara escolhe praticar com João a Consciência Fonológica, começando um novo jogo/tarefa de “Segmentação Silábica”. A Professora Sara contextualiza João com a tarefa que terá de desempenhar e pede-lhe para iniciar a mesma. Depois de completar todas as etapas, João conclui a 1ª tarefa, podendo avançar com a seguinte.\n\nSCENARIO 3 - P4\n\nNo centro de estudos onde trabalha, Pedro acompanha regularmente alunos em aulas individuais. Na 1ª aula de um novo aluno, Pedro decide utilizar a Plataforma Ainda Estou a Aprender para diagnosticar qual o nível de aprendizagem em que o aluno se encontra. Pedro acede à plataforma com o seu login de professor, escolhe o grupo referente ao centro de estudos e adiciona um novo aluno. Depois de criar um perfil para o novo aluno, escolhe o modo de diagnóstico “O Que Já Sei” e escolhe a opção “Compreensão”. Pedro seleciona a 1ª tarefa “Lenda de São Martinho” e desafio o seu aluno a completar a mesma.\n\n![](https://pro2-bar-s3-cdn-cf6.myportfolio.com/c9705683af375f880d0107ef723fd86a/7109b2d0-90ec-4bbe-a864-5b158c9aca86_rw_1200.jpg?h=5214843bbf6c7ffae77dc111216ea2c7)\n\n![](https://pro2-bar-s3-cdn-cf1.myportfolio.com/c9705683af375f880d0107ef723fd86a/c101ad29-4ce5-4806-aab3-f76106264516_rw_1200.jpg?h=02c64ff4fa69e86a7afce06afc0117de)\n\n###### One of the teachers used a paper version to do the entries of reading issues.\n\n4. UNDERSTANDING OPPORTUNITIES\n\nWhen we first went talking to the education researchers who conceived the project we understood that the platform was based on a 2 steps flow:\n\n\\- Diagnosis: running tasks together with the student to identify his struggling points.\\\n- Intervention: practicing specific tasks according to the reports generated by the Diagnosis module.\n\nThe researcher explained to us that they had an almost mathematical way to define reading ability levels.\n\nWhen we went to the schools and realised that the teachers were not using such dynamic we figured out why it was not working the way it was supposed to be.\n\nFLOW PROBLEM\n\nFirst, the buttons to choose between the diagnosis and intervention modules were ambiguous and confusing. The diagnosis mode was called \"What I Already Know\" and the intervention mode was called \" What I'm going to learn\".\n\nTeachers taught that the diagnosis mode was what the student had already performed and the intervention mode what he still had to do.\n\nREPORTS PROBLEM\n\nSecond, the reports were many and named with time and date labels that didn't help to find by task done. To have an overall reading status of a certain student, teachers had to download all the different reports and then add and cross the data among them to then go to the intervention mode and define which tasks should be done to solve that student issues.\n\nThey say the Russians took a pencil to write with no gravity, instead of inventing a ballpoint pen that could write in those conditions.\n\nIf we're developing a tool, It only makes sense if it's going to help the user. If with our tool he'll perform better, faster, in a more efficient and satisfying way a task than without it.\n\nTeachers have a lot of work, have a lot of students. The more bureaucratic work they are given, the less time they will have to be with the students.​​​​​​​\n\n![](https://pro2-bar-s3-cdn-cf3.myportfolio.com/c9705683af375f880d0107ef723fd86a/46a16105-49e1-4f17-8ef5-a68e14fb5a14_rw_1920.png?h=081a671fec7e34f81ab23f91ae3d5ee1)\n\nOPPORTUNITY\n\nWe decided to workfree time for the teachers to do what they are the best in: teaching.And design a platform that, together with some AI, would do the bureaucratic work for them.\n\n![](https://pro2-bar-s3-cdn-cf1.myportfolio.com/c9705683af375f880d0107ef723fd86a/c60ec04d-b30b-4a0b-a17a-1aa69b58d50e_rw_3840.jpg?h=f58fadb739aab1f1e5bf4dc9552192e9)\n\n7. SKETCHES, LO-FI, MID-FI PROTOTYPING AND IMPORTANT DESIGN DECISION\n\nSince the beginning we were considering a dashboard with links to the other sessions of the platform. After the user research and putting more thought into the product core feature, we decided to recreate the teacher's feeling of getting into a classroom. So once, he logs in the platform, he immediately sees all his students\n\n10. IMPROVEMENTS BASED ON USER TESTING INSIGHTS\n\nWhen we had a prototype of the platform, we performed a few tests that brought us excellent insights. We highlight the taxonomy of links and buttons such as: Dashboard, that was substituted by My Students and Downloads, that was changed to Paper Version\n\nFINAL INTERFACE\n\nThis video shows the end-product inside the scope of the teachers profile. Once we had time constraints due to the final project deadline, we decided to redesign only the teacher's profile. We made a quite stable design system so it will be easy to design the student's side.\n\nFUTURE WORK\n\nConnection Interfaces\\\nDraw the interfaces that connect the student profile in the diagnostic module to the individual student profile in the intervention module.\n\n\\- Redesign the task assignment interface according to the dynamics that will be created by the research body.\n\n\\- Draw the interface so that the teacher can follow the evolution of the tasks assigned to the students.\n\n\\\nMobile First\n\nDuring the user research process, we identified that many of the students most in need of intervention do not have access to desktop or laptop computers, but have access to smartphones. They often play games on their parents' cell phones.\n\nThe intervention platform, individual of each student, should have the mobile phone as a great transformation tool. It's important to promote an experience that competes with what kids are looking for on smartphones.",
  "description": "Tool to help teachers to diagnose reading issues and to keep track of kids development."
}