{
  "date": "2019-02-19T22:01:47.555Z",
  "title": "Let it grow",
  "body": "6 months ago, I had no idea what Sketch, XD, Figma, Material Design, Norman, Nielsen, ISO 9241-11, were. Actually, I had no clue of that*brave new world*that was already surrounding me. When I finally faced it, I asked myself: am I too late for this party?\n\nI just had to let it grow. 👸\n\nMy grandma went to law school when she was 40 yeas old, graduated and worked her whole life, I’m only 29! Practice makes it perfect, let’s keep faking it until we make it!\n\nSometimes I start studying about a specific topic in UX, and end up with a long list of links that I’ll catch up*later*(or never), so I decided to share**six**of them with some personal experiences.\n\nHope you enjoy it!\n\n1-**About modals**\n\nSo I started looking for further information about when and how should I use modals in my designs so I wouldn’t just hide extra information that didn’t fit anywhere else.\n\n<https://uxmag.com/articles/modals-on-mobile-how-to-use-them-wisely>\n\n- - -\n\n**2- Friction as a design tool**\n\nFrom there I jumped right into this article about how can we add friction as a design tool, especially for error prevention.\n\n<https://www.smashingmagazine.com/2018/01/friction-ux-design-tool/>\n\n- - -\n\n**3- From this article, I went to an amazing Google’s Podcast.**\n\nI confess I didn’t read this whole article (yet), BUT this was an important bridge that took me to this Google series of talks between a Designer and many developers. Because I’m designing[Betmarkets](http://betmarkets.io/)users and experts interface, I’m going through the process of understanding the importance of designing with components and negotiating with the front-end about some design decisions. These series of conversations are really clarifying. ❤️\n\n<https://medium.com/dev-channel/getting-started-with-ux-research-f6ac3e5c26a0>\n\n**Google’s Podcast**\n\n- - -\n\n**4- The first time I heard about PWA**\n\n🤔[In the third episode of Developer vs. Designer,](https://www.youtube.com/watch?v=J8Hj5bIYuYA&list=PLNYkxOF6rcIC60856GnLEV5GQXMxc9ByJ&index=23)I heard for the first time about PWA. When we migrate from graphic design, not only we come with the tools we had in our skills set, but we tend to bring our mental model, our mindset and our language. Designing human interactions with the web asks for a deep dive into the web’s mindset, vocabulary and mental modal.\n\n<https://medium.com/@deepusnath/4-points-to-keep-in-mind-before-introducing-progressive-web-apps-pwa-to-your-team-8dc66bcf6011>\n\n- - -\n\n**5- Getting to know the basics of Sketch**\n\nThen I was looking for Sketch tutorials to find out a specific prototype feature (overlay), and I found this short ( 🕒20min video and article) that I think that summarizes Sketch quite well and gave me some tricks.<https://designcode.io/sketch-learn>\n\n- - -\n\n**6- Web Font Optimization**\n\nLast month I was having this huge struggle with the font that I’m using in my designs. It’s a google fonts font and it was just so different in the implemented version, I couldn’t figure out why. I burned out all the code I learned from[She Codes](https://shecodes.io/students/gaya-rabello) and found out that there were missing the font weights inside the font declaration. Felt like a genius. 🤓\n\n<https://developers.google.com/web/fundamentals/performance/optimizing-content-efficiency/webfont-optimization?utm_campaign=chrome_series_webfontsoptimization_050917&utm_source=chromedev&utm_medium=yt-desc>\n\n- - -\n\nIf you got down here, you’re probably my mom.\n\n👍\n\nI thank you so much for your interest!\n\nSee you later, alligator!",
  "description": "6 months ago, I had no idea what Sketch, XD, Figma, Material Design, Norman, Nielsen, ISO 9241-11, were. "
}