{
  "date": "2020-04-07T20:55:34.980Z",
  "title": "UXchange",
  "description": "I went to this amazing meetup about Inclusive Design with a tremendous guy called David Cruz.",
  "body": "> “May I come in? I’m sorry, I’m late”.\n>\n> Myself arriving to the English course in 2003.\n\nI think these were the first sentences I learned in English, even before “The book is on the table.” I’m sorry, I know this should have been posted yesterday, but I promise the delay will bring proportional benefits.\n\nJust like Heraclitus, that never steps in the same river twice, yesterday, I just couldn’t write what I’m writing today. Today I went to this amazing[meetup](https://www.meetup.com/Product-Design-Club/events/259076925/)about Inclusive Design with a tremendous guy called[David Cruz.](https://pt.linkedin.com/in/davidjvcruz)\n\nFor the sake of humanity, I’ll share with you some of the knowledge that David had the generosity to show us today:\n\n1- Inclusive design is a Methodology, accessibility is an attribute.\n\n2- Think about the needs of EVERY possible user.\n\n3- If enhancing life quality and information access to people around the globe aren’t core values in the company that you work, or for your clients, here come three good “arguments”:\n\n* Beyond the Ethical issue, you can be just**egoistic**like: you’ll be old soon, you better design things today that you might be able to use*“when your legs don’t work like they used to before”.*\n* **Legal**: accessibility is already an obligation for education and governmental web products in some countries.\n* **Money**, money, money, moneeeeey! 15% of the world population has some kind of disability, are you sure you’re willing to lose that stake of the market?\n\n4- Try to put yourself in these user’s shoes so you can better understand the impact of the lack of accessibility in people’s life. Experiment the following methods to test and evaluate the work of art that you think you’re doing:\n\n**Visual**\n\n* Use vegetal paper or transparencies to emulate Cataract\n* Put your hand or a stick with a paper circle in front of your face to emulate macular degeneration.\n* Paint random stains on transparency to emulate Diabetes Retinopathy\n* Use this[Chrome extension](https://chrome.google.com/webstore/detail/nocoffee/jjeeggmbnhckmgdhmgdckeigabjfbddl/related)to emulate color issues and many other visual disabilities.\n* [SimDaltonism](https://itunes.apple.com/us/app/sim-daltonism/id693112260?mt=12) and [Color Oracle](https://colororacle.org/) are also focused on color.\n\n**Motor**\n\nDavid showed us this video, beginning in minute 4:15 and told us a few tricks we can use to simulate motor constraints:\n\n* Use sticks to type\n* Tide your fingers with a rubber\n* Try to use a mobile or the trackpad with kitchen gloves\n* Use your only left (or right) hand to interact\n\n**Listening**\n\n* Try using those sound blockers headphones\n* Use your mobile while your computer makes some noise\n\n**Digital Illiteracy**\n\n* Use sticks to type and rubber gloves to touch\n\n**Ambiental**\n\n* **Go outside!**Test your designs under the sun\n* Try to speak to Alexa or Siri with something big in your mouth\n* Try voice recognition in a noisy ambient (or simulate it)\n\n**And more!**\n\n* Test you typography in an old monitor\n* **Give some space:**move 2 or 3 meters away from your designs\n* Try to do something on your desktop without trackpad or mouse.\n\n![My grandfather wearing sunglasses](https://gayaexperience.files.wordpress.com/2019/02/vo.jpg \"This post is dedicated to my beloved grandfather, Former Engineer, content manager and power point specialist. He lives without his right arm due to cancer. His braveness to amputee his arm gave me the opportunity to enjoy his sweet company for long conversations and for losing chess matches.\")\n\nThis post is dedicated to my beloved grandfather, Former Engineer, content manager and power point specialist. He lives without his right arm due to cancer. His braveness to amputee his arm gave me the opportunity to enjoy his sweet company for long conversations and for losing chess matches.\n\nLong life to vovô Helio, a better life for everyone! Cheers grandpa! ❤\n\n\\#EveryoneMatters #AccessibilityMatters"
}